# GetRodStructureExtension Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..GetRodStructureExtension Method
FabricationRodInfo Class See Also
---
Gets the length of the rod's top extension into structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double GetRodStructureExtension(
	int rodIndex
)
```

Visual Basic
---
```text
Public Function GetRodStructureExtension ( _
	rodIndex As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetRodStructureExtension(
	int rodIndex
)
```

# ### Parameters
rodIndex
    Type: System..::..Int32 The rod index.
# ### Return Value
Returns the extension length that will be applied if the rod is attached to structure.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace